{"meta":{"title":"小轲博客","subtitle":"代莲花开尽后，便是清欢","description":"小轲博客，是小轲的个人博客！更新个人教程，网站程序等。当然会更新小轲自己的生活等","author":"小轲博客","url":"https://www.957xx.cc"},"pages":[{"title":"关于","date":"2018-06-29T13:59:01.000Z","updated":"2020-02-21T13:55:07.040Z","comments":true,"path":"about/index.html","permalink":"https://www.957xx.cc/about/index.html","excerpt":"","text":"关于关于博主 About美丽的家乡：河北邯郸 目前情况：在北京当一个码农 目前接触的语言: Java 随后则 欢迎你您来到本站，畅所欲言的交流技术、生活 关于博客经历：2016年12月这个博客诞生了，那时候还是emlog的系统，小白一个什么都不会玩。 2017年4月 第一个主机商跑路，数据全无。悼念 2017年5月 走进Zblog，更换：957xx.cc 学习很多博客的维护，也认识了一帮不错的家伙。也感谢这帮家伙 2017年6月 停止维护了一个月大概，因为当时个人原因 2018年5月 晚上跟朋友一起吃饭，大哥发消息提醒我博客出问题了。折腾了一番痛心的更换系统吧，可能是自己的技术不到 位。 2018年5月底 走进了Typecho,但愿你还在。 2018年6.30 走进了Hexo大家庭走向简洁。 社交联系：QQ：2501521908 Email：admin@957xx.cc 加我的微信，畅所欲言。"},{"title":"友情链接","date":"2018-06-29T13:59:01.000Z","updated":"2020-07-12T05:22:30.613Z","comments":true,"path":"友情链接/index.html","permalink":"https://www.957xx.cc/友情链接/index.html","excerpt":"","text":"友情链接Hi，来自远方的朋友，别来无恙啊。 欢迎交换链接： 本站信息： 域名：https://www.957xx.cc name:小轲博客 说明：代莲花开尽后，便是清欢。（当然啦随心所欲，你怎么开心怎么来！） 基佬们： WangMao’s Blog 彩虹 唯美陌阡 奔跑的番茄 保罗的小宇宙 许发君 情醉中国风 小健 现在网 淘气 飞翔勿扰 luka-chen 恶魔菌の记事簿 林阿三 东方幻梦 Future iDeal 王荣胜 花の海 也许你们离开了，也许我们记不清最后的访问是什么时候了，但是如果你们回来了，请联系我 胡俊杰 虫子"}],"posts":[{"title":"为什么不建议把数据库部署在docker容器内？","slug":"为什么不建议把数据库部署在docker容器内？","date":"2020-08-26T03:08:46.000Z","updated":"2020-08-26T03:09:13.077Z","comments":true,"path":"2020/08/26/为什么不建议把数据库部署在docker容器内？/","link":"","permalink":"https://www.957xx.cc/2020/08/26/为什么不建议把数据库部署在docker容器内？/","excerpt":"","text":"前言:近2年Docker非常的火热，各位开发者恨不得把所有的应用、软件都部署在Docker容器中，但是您确定也要把数据库也部署的容器中吗？ 这个问题不是子虚乌有，因为在网上能够找到很多各种操作手册和视频教程，整理了一些数据库不适合容器化的原因供大家参考，同时也希望大家在使用时能够谨慎一点。 目前为止将数据库容器化是非常不合理的，但是容器化的优点相信各位开发者都尝到了甜头，希望随着技术的发展能够更加完美的解决方案出现。 Docker不适合部署数据库的7大原因1、数据安全问题不要将数据储存在容器中，这也是 Docker 官方容器使用技巧中的一条。容器随时可以停止、或者删除。当容器被rm掉，容器里的数据将会丢失。为了避免数据丢失，用户可以使用数据卷挂载来存储数据。但是容器的 Volumes 设计是围绕 Union FS 镜像层提供持久存储，数据安全缺乏保证。如果容器突然崩溃，数据库未正常关闭，可能会损坏数据。另外，容器里共享数据卷组，对物理机硬件损伤也比较大。 即使你要把 Docker 数据放在主机来存储 ，它依然不能保证不丢数据。 Docker volumes 的设计围绕 Union FS 镜像层提供持久存储，但它仍然缺乏保证。 使用当前的存储驱动程序，Docker 仍然存在不可靠的风险。 如果容器崩溃并数据库未正确关闭，则可能会损坏数据。 2、性能问题大家都知道，MySQL 属于关系型数据库，对IO要求较高。当一台物理机跑多个时，IO就会累加，导致IO瓶颈，大大降低 MySQL 的读写性能。 在一次Docker应用的十大难点专场上，某国有银行的一位架构师也曾提出过：“数据库的性能瓶颈一般出现在IO上面，如果按 Docker 的思路，那么多个docker最终IO请求又会出现在存储上面。现在互联网的数据库多是share nothing的架构，可能这也是不考虑迁移到 Docker 的一个因素吧”。 针对性能问题有些同学可能也有相对应的方案来解决： (1)数据库程序与数据分离 如果使用Docker 跑 MySQL，数据库程序与数据需要进行分离，将数据存放到共享存储，程序放到容器里。如果容器有异常或 MySQL 服务异常，自动启动一个全新的容器。另外，建议不要把数据存放到宿主机里，宿主机和容器共享卷组，对宿主机损坏的影响比较大。 (2)跑轻量级或分布式数据库 Docker 里部署轻量级或分布式数据库，Docker 本身就推荐服务挂掉，自动启动新容器，而不是继续重启容器服务。 (3)合理布局应用 对于IO要求比较高的应用或者服务，将数据库部署在物理机或者KVM中比较合适。目前TX云的TDSQL和阿里的Oceanbase都是直接部署在物理机器，而非Docker 。 3、网络问题要理解 Docker 网络，您必须对网络虚拟化有深入的了解。也必须准备应付好意外情况。你可能需要在没有支持或没有额外工具的情况下，进行 bug 修复。 我们知道：数据库需要专用的和持久的吞吐量，以实现更高的负载。我们还知道容器是虚拟机管理程序和主机虚拟机背后的一个隔离层。然而网络对于数据库复制是至关重要的，其中需要主从数据库间 24/7 的稳定连接。未解决的 Docker 网络问题在1.9版本依然没有得到解决。 把这些问题放在一起，容器化使数据库容器很难管理。我知道你是一个顶级的工程师，什么问题都可以得到解决。但是，你需要花多少时间解决 Docker 网络问题？将数据库放在专用环境不会更好吗？节省时间来专注于真正重要的业务目标。 4、状态在 Docker 中打包无状态服务是很酷的，可以实现编排容器并解决单点故障问题。 但是数据库呢？ 将数据库放在同一个环境中，它将会是有状态的，并使系统故障的范围更大。下次您的应用程序实例或应用程序崩溃，可能会影响数据库。 知识点在 Docker 中水平伸缩只能用于无状态计算服务，而不是数据库。 Docker 快速扩展的一个重要特征就是无状态，具有数据状态的都不适合直接放在 Docker 里面，如果 Docker 中安装数据库，存储服务需要单独提供。 目前，TX云的TDSQL(金融分布式数据库)和阿里云的Oceanbase(分布式数据库系统)都直接运行中在物理机器上，并非使用便于管理的 Docker 上。 5、资源隔离资源隔离方面，Docker 确实不如虚拟机KVM，Docker是利用Cgroup实现资源限制的，只能限制资源消耗的最大值，而不能隔绝其他程序占用自己的资源。如果其他应用过渡占用物理机资源，将会影响容器里 MySQL 的读写效率。 需要的隔离级别越多，获得的资源开销就越多。 相比专用环境而言，容易水平伸缩是Docker的一大优势。 然而在 Docker 中水平伸缩只能用于无状态计算服务，数据库并不适用。 我们没有看到任何针对数据库的隔离功能，那为什么我们应该把它放在容器中呢？ 6、云平台的不适用性大部分人通过共有云开始项目。 云简化了虚拟机操作和替换的复杂性，因此不需要在夜间或周末没有人工作时间来测试新的硬件环境。当我们可以迅速启动一个实例的时候，为什么我们需要担心这个实例运行的环境？ 这就是为什么我们向云提供商支付很多费用的原因。 当我们为实例放置数据库容器时，上面说的这些便利性就不存在了。因为数据不匹配，新实例不会与现有的实例兼容，如果要限制实例使用单机服务，应该让 DB 使用非容器化环境，我们仅仅需要为计算服务层保留弹性扩展的能力。 7、运行数据库的环境需求常看到 DBMS 容器和其他服务运行在同一主机上。 然而这些服务对硬件要求是非常不同的。 数据库（特别是关系型数据库）对 IO 的要求较高。 一般数据库引擎为了避免并发资源竞争而使用专用环境。如果将你的数据库放在容器中，那么将浪费你的项目的资源。 因为你需要为该实例配置大量额外的资源。 在公有云，当你需要 34G 内存时，你启动的实例却必须开 64G 内存。在实践中，这些资源并未完全使用。 怎么解决？ 您可以分层设计，并使用固定资源来启动不同层次的多个实例。 水平伸缩总是比垂直伸缩更好。 总结针对上面问题是不是说数据库一定不要部署在容器里吗？ 答案是：并不是 我们可以把数据丢失不敏感的业务（搜索、埋点）就可以数据化，利用数据库分片来来增加实例数，从而增加吞吐量。 docker适合跑轻量级或分布式数据库，当docker服务挂掉，会自动启动新容器，而不是继续重启容器服务。 数据库利用中间件和容器化系统能够自动伸缩、容灾、切换、自带多个节点，也是可以进行容器化的。","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://www.957xx.cc/tags/技术/"}]},{"title":"2019给自己的年终总结","slug":"2019给自己的年终总结","date":"2019-12-31T03:15:39.000Z","updated":"2020-01-07T07:23:21.165Z","comments":true,"path":"2019/12/31/2019给自己的年终总结/","link":"","permalink":"https://www.957xx.cc/2019/12/31/2019给自己的年终总结/","excerpt":"","text":"开头:新的一年新的气象，我看各个博主都已经开始给自己立了一个新年的总结，下午前脚把代码Push上，我就过来给自己一个总结，毕竟觉得自己是挺重要的一年！ 因为自己是做技术的，先总结一下自己的技术: 技术:今年是个提升自己的一年，为什么这么说呢？ 自己的编码水平得到了突飞猛进的进展(目前自认为)。因为之前自己的水平回忆起来真的是不堪回首。 新的一年，掌握了新的微服务框架技术、Docker容器化技术、以及Java相关的常用化组件等等…..当然2020年我还会继续向这种高用户量的需求解决框架延申，为自己扩展提升更好的技能。 旅游:今年的旅游收获了很多的好心情，并且发现去一个很美的地方可以让人快速的修复自己疲惫的心灵，也跟自己的好哥们第一次去人生中的海边，旅游没得说，之后有机会我就一定会选择去旅游，也还有自己在北京觉得很好看的地方。 日出 海边: 海洋馆: 冰面: 在北京的记忆: 工作:今年年底入职北京的一家公司担任 Java开发工程师 一职 ，目前的项目为: “金库管理平台”，当然，我只是一个这个面向B端产品的一个小蚂蚁，新的一年我也会更加努力的去做好我的本职工作，努力提升自己。好好生活，对自己要好一点！家人都不在身边，只能自己照顾好自己，嘻嘻~ 博客:在2019年，自己没有抽出来时间管理自己的发霉的小窝。但是我一直有关注。我、以及我的朋友们的博客似乎都缺少了时间来管理自己的博客，因为回想起来从17年到现在了，大家有的站点还在坚持更新记录。有的已经遗憾的Get不到了，我也好几次没有打理出来自己的博客，不过我还是坚持过来了！ 不管怎么样希望看见这篇总结的朋友 新的一年前程似锦。 往前的目标我就更清楚了。新的一年，我要抽出来更多的时间来管理自己的博客，记录自己的生活。 总结:扯了这么多，把自己的2019年的flag拿出来，对比一下。 1.在北京实习找到一份稳定的饭碗。 √ 2.去一次旅游(见一个人) 不知道能不能 × 我想之后可能也不会了。 3.希望在年底学会开车 嗯，这个已经在练习考科一做题了，年假回家学习开车。 新的一年对自己说的话: 2020,张帅轲 希望你好好努力，要对自己的技术要求更严格，对自己的提升永远不要放下。不辜负自己、朋友、家人才是最重要的，加油。","categories":[],"tags":[{"name":"总结","slug":"总结","permalink":"https://www.957xx.cc/tags/总结/"}]},{"title":"个人主页折腾记","slug":"个人主页折腾记","date":"2019-06-07T04:45:02.000Z","updated":"2019-06-08T10:33:10.000Z","comments":true,"path":"2019/06/07/个人主页折腾记/","link":"","permalink":"https://www.957xx.cc/2019/06/07/个人主页折腾记/","excerpt":"","text":"活跃一下,不然可能以为我sei了！ 端午节在家无聊,所以把之前的个人主页更新了一下,毕竟这是我的第一个域名也是我的第一个网站,怀念当年的感觉也很喜欢那时候的感觉,所以决定更新一手！ 话不多说,先上图！ (开局一张图,故事全靠编) 网站图片首页： 关于我 网站的小功能List:1：依旧存在 中英繁 国际化页面 2：增加一言： 一些可以鼓励自己的心灵鸡汤之类的 3：更简洁大气的页面 4：增加邮件联系的方式 这个网站是我很喜欢的一个网站,并且我有精力就努力的维护下去,很有纪念意义！ ———————–中场抱怨一手————————- 嗯今天看了好多朋友的网站,发现有的可能已经宕机，有的做的越来越帅,也发现了很多人已经停更。可能都来不及说一声再见把！ ———————–中场抱怨结束————————- 更新之后的设计使用了现在很流行的弧形UI，配色使用了贵族很喜欢用的紫色！嗯 自我感觉良好 关于源代码:我在挂别的地方测试的时候就已经很多小伙伴找我要了,反正静态的网站,很喜欢我们就一起用 hhh 全球最大的同性交友网站链接奉上: https://github.com/a2501521908/homedemo 嗯！ 最后祝各位老朋友: 天天快乐，幸福安康。","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://www.957xx.cc/tags/技术/"}]},{"title":"新的一年,HI!","slug":"新的一年-HI","date":"2019-02-12T05:31:08.000Z","updated":"2019-07-02T09:35:18.000Z","comments":true,"path":"2019/02/12/新的一年-HI/","link":"","permalink":"https://www.957xx.cc/2019/02/12/新的一年-HI/","excerpt":"","text":"转眼已经2019了,时间过的可是真快,生活还是那么的苟且，坐在即将出发的路上给自己来一个晚来的新年文章。 先给自己来一个简单的2018的年总结吧:1：博客折腾折腾我还是到了hexo,并且越来越懒了…​ 2018年夏天左右,服务器到期了现在我一个穷鬼想了想还是不要弄服务器的了,毕竟来回都是RMB，能少点阿里就少点吧,还可以学习一点新的东西 2：来到了我现在的学校,努力的学习,放下了一切的杂念(以后我想也不会了)​ 还是清楚的记得去年的我狂妄自大的去做一些事情，结果在3月份出来去宿迁看一个学校的时候，试听期间就感觉到了这里大佬云集,甚至说的东西我都还有点听不懂,才知道自己的三斤八两,不过也还是把自己的性子磨了磨，但是也有一些原因来到了我现在的学校。 3: 年底了学校给了15天的假期回家,给自己动了个小小的手术,emm​ 今年回家回来,不知道是我真的点背还是怎么,脚的指甲老是去肉里探索(瞬间心里wc)，一想到始终还是得做,毕竟到时候上班回来的话时间可能会更少,就去了医院做了这个小小的手术。 ​ 当然了,这个年假是我目前活这么长最无聊的年假,真真正正的躺了15天,在上车的前两个小时,抓紧回来更新了这个文章,希望自己以后可以幸运点. ​ 不过时间没有白白浪费掉还好,我和我的小组一起趁着年假，做了一个小小的项目,也学会了很多的业务逻辑 哈哈哈，看到这里可能：？？？ 黑人问号，你到底在干了什么 现在在学习的一些东西:​ 1:首要的就是把自己眼前的java学好,以及深入java web开发 ​ 2:学习一些框架,自学一些语言等 ​ 3:以及一些大数据时代一个bug触发机必须掌握的东西 嗯,可能大神看到了这个微微一笑,没错我确实好菜,希望到时候大佬带带我~ EMMMMMMMMM—————–这可能是最心情复杂的文章 为什么这么说呢？因为在写上面的时候我还在不慌不忙的写，结果直接告诉我，高速封路了……. 赶紧合起来电脑就去高铁站,就想着期待有一张我的票,慌慌张张的emm,想着只要是别误了我上课怎么都行,售票员小哥哥跟我说,高铁没了就剩下一张站着的火车票,瞬间运气爆棚 站着上了火车。 当我走到石家庄的时候,有一个人可能是坐累了,叫了我一下他就抱着孩子去卧铺那边了,真的是遇到贵人了,在火车上都不敢睡觉,生怕人家回来了人家站着我在哪坐着,EMMMM 就这样到了北京站直接就回来了，2点多,被这场封高速已经弄得绝望了。 扯这么多,给自己的2019立一个flag吧！1.在北京实习找到一份稳定的饭碗。 2.去一次旅游(见一个人) 不知道能不能 3.希望在年底学会开车 哈哈~~ 嘿嘿,给大家一声晚来的新年快乐！ ​","categories":[],"tags":[{"name":"谈心","slug":"谈心","permalink":"https://www.957xx.cc/tags/谈心/"}]},{"title":"29.22分钟学会正则表达式","slug":"29-22分钟学会正则表达式","date":"2018-11-22T10:10:57.000Z","updated":"2018-11-22T10:27:44.000Z","comments":true,"path":"2018/11/22/29-22分钟学会正则表达式/","link":"","permalink":"https://www.957xx.cc/2018/11/22/29-22分钟学会正则表达式/","excerpt":"","text":"写在最前面看到标题你可能会疑惑为什么不是30分钟？因为我这个文章图文并茂，非常恐怖，兄弟，其实你不用30分钟就可以看懂。你可能会以为我在吹牛B，但是当你看完的时候，一掐表，你会发现我真的是在吹牛B那又为什么是.22呢？作为一个理科生，保留两位小数是不变的信仰。而在下，仅仅是喜欢2这个数字，如是而已 正则表达式正则表达式，又称规则表达式。（英语：Regular Expression，在代码中常简写为regex、regexp或RE），计算机科学的一个概念。正则表达式通常被用来检索、替换、校验那些符合某个模式(规则)的文本。 RegExp对象在爪洼死苦瑞per特中，RegExp 对象表示正则表达式，它是对字符串执行模式匹配的强大工具。那么要如何使用呢？两种方式：字面量，构造函数 123var reg = /\\bhello\\b/g //字面量 // \\b代表单词边界（WordBoundary） 也就是说这个正则匹配的是 hello world这种hello 而不是helloworld//因为helloworld连起来了，没有单词边界 12345var reg = new RegExp(&apos;\\\\bhello\\\\b&apos;,&apos;g&apos;)//注意两者的区别//后面这种方法需要转义反斜杠（javascript的原因）,//而且这个g(修饰符,全局匹配)是单独提取出来的//而且正则两边没有/包围的，上面第一种是这样的=&gt; /正则表达式/ 正则可视化工具Regulex可视化图形，对理解正则有非常大的帮助二话不说先进来这个网站，这个文章将使用这个网站来验证写的例子。 元字符正则表达式由两种基本字符类组成 原义字符 元字符 原义字符，就是表示原本意思的字符，像上面正则中的hello，就代表匹配hello这个字符串元字符呢，就是表示不是原本意思的字符，这样想就简单多了吧。像上面这个\\b 既然元字符表示的不是本身的字符，那我如果就要匹配它原本的字符呢？比如说我就要匹配+号，*号，那么请使用 \\ 来转义字符 下面这些元字符先随便过一遍先，不用背熟也可往下看~ $ 匹配输入字符串的结尾位置。如果设置了 RegExp 对象的 Multiline 属性，则 $ 也匹配 ‘n’ 或 ‘r’。要匹配 $ 字符本身，请使用 \\$。 () 标记一个子表达式的开始和结束位置。子表达式可以获取供以后使用。要匹配这些字符，请使用 ( 和 )。 * 匹配前面的子表达式零次或多次。要匹配 字符，请使用 。 + 匹配前面的子表达式一次或多次。要匹配 + 字符，请使用 +。 . 匹配除换行符 n 之外的任何单字符。要匹配 . ，请使用 . 。 [] 标记一个中括号表达式的开始。要匹配 [，请使用 [。 {} 标记限定符表达式的开始。要匹配 {，请使用 {。 | 指明两项之间的一个选择。要匹配 |，请使用 |。 ? 匹配前面的子表达式零次或一次，或指明一个非贪婪限定符。要匹配 ? 字符，请使用 ?。 \\ 将下一个字符标记为或特殊字符、或原义字符、或向后引用、或八进制转义符。例如， ‘n’ 匹配字符 ‘n’。’n’ 匹配换行符。序列 ‘\\’ 匹配 “”，而 ‘(‘ 则匹配 “(“。 ^ 匹配输入字符串的开始位置，除非在方括号表达式中使用，此时它表示不接受该字符集合。要匹配 ^ 字符本身，请使用 ^。 \\cX 匹配由x指明的控制字符。例如， cM 匹配一个 Control-M 或回车符。x 的值必须为 A-Z 或 a-z 之一。否则，将 c 视为一个原义的 ‘c’ 字符。 \\f 匹配一个换页符。等价于 x0c 和 cL。 \\n 匹配一个换行符。等价于 x0a 和 cJ。 \\r 匹配一个回车符。等价于 x0d 和 cM。 \\s 匹配任何空白字符，包括空格、制表符、换页符等等。等价于 [ fnrtv]。注意 Unicode 正则表达式会匹配全角空格符。 \\S 匹配任何非空白字符。等价于 1。 \\t 匹配一个制表符。等价于 x09 和 cI。 \\v 匹配一个垂直制表符。等价于 x0b 和 cK 边界 从一开始的例子我们就知道了这个b,不对，是这个\\b他表示的就是单词边界的意思.我们知道，fck这个是有很多用法的，可以单独用，也可以加个ing多种词性使用。然后我们只想找到单独的fck,看代码 12345//作为光荣的社会主义接班人怎么可能用f*ck做例子呢?var reg = /\\bis\\b/g;var str = &quot;this is me&quot;;str.replace(reg,&apos;X&apos;)//&quot;this X me&quot; 1234var reg = /is/g;var str = &quot;this is me&quot;;str.replace(reg,&apos;X&apos;)//&quot;thX X me&quot; 两者区别清晰可见，不容我多说了吧，各位客官。 再来看看一个问题，如果我只要开头部分的A字符而文本中间的A字符却不要，又该如何？只需如此，便可对敌 1234var reg = /^A/g;var str = &quot;ABA&quot;;str.replace(reg,&apos;X&apos;);//&quot;XBA&quot; 需要以A为结尾的正则，则是如下 1234var reg = /A$/g;var str = &quot;ABA&quot;;str.replace(reg,&apos;X&apos;);//&quot;ABX&quot; 注意，正如开头结尾的位置一样，^和$的位置也是如此，^放在正则表达式前面，$放在表达式后面 字符类一般情况下，正则表达式一个字符对应字符串的一个字符比如表达式 \\bhello 就表示 匹配 字符\\b h e l l o， 如果我们想要匹配一类字符的时候?比如我要匹配a或者b或者c，我们就可以使用元字符 []来构建一个简单的类[a,b,c]就把a，b，c归为一类，表示可以匹配a或者b或者c。如果你会一丢丢英文的话，你应该就可以看懂下面的图，one of a，b，c，也就是匹配abc中任意一个~ 范围类当我们学习了上面的内容以后，如果我们要写匹配0到9的数字，就应该是这样写 但是如果我要匹配更多呢？那不是键盘都要敲烂了？这正则也太不智能了吧？？？显然，你能想到的，创造正则的人也想到了我们可以这样子 好了，方便了一些，然后你可能又会吃惊，那么我的短横线-呢？我如果要匹配0-9以及短横线呢？莫慌，只要在后面补回去即可这个图可以清楚看到有两条分支，也就是说我可以走0-9这条路也可以走短横线这条路 预定义类学习了上面以后，我们就可以书写匹配数字的正则了，[0-9] 那么有没有更简便更短的方法呢？ 巧了，正则就是辣么强大 在上面的元字符部分内容中，你可能已经窥得其中精妙了 上表格，不是，上图（这个segmentfault哪里插入表格啊？？） 我们可以根据英文单词的意思，来记住这些预定义类的用法。我们发现，大写字母和小写字母的区别就是取反!，如d和D同时我们从表格中的等价类可以发现如果我们要一个类的取反，那么就在类中加一个 ^none of abc 量词如果要你写一个匹配10个数字的正则？你会怎么写诶~你可能已经胸有成竹的写下了 1\\d\\d\\d\\d\\d\\d\\d\\d\\d\\d 吃惊，你会发现，尽管是你单身二十余年的右手，依然感到了一丝乏力！疲惫，有时是在过度劳累之后为了挽救一些人的右臂，正则有了量词实现上面的需求我们只要 \\d{10} Digit 10times为了方便一些英语不好的人，比如我，我甚至使用了鲜为人知的百度翻译（广告费私我） 但是，如果我不知道要匹配具体多少个数字呢？反正就是匹配100个到1000个之间的数字当当当当~ 让我们看看可视化工具的结果，方便理解 注意，这个{n,m}是包括n次和m次的哦，是闭区间哦 贪婪模式与非贪婪模式从上面一则我们知道，如果我们要匹配100到1000个数字的话，是这样写\\d{100,1000}如果我给的字符串里有1000个数字，但是我只想匹配前面100个呢？ 如果按照上面这样写，则如下 1234var reg = /\\d&#123;3,6&#125;/;var str = &quot;123456789&quot;;str.replace(reg,&apos;替换成这个&apos;);//&quot;替换成这个789&quot; 我们可以看到，上面这个例子是匹配了6个数字，将6个数字替换了，尽管他的正则匹配的是3到6个数字。 没错，它是贪婪的！它会尽可能地匹配更多！这就是正则的 贪婪匹配，这是默认的，如果我们不想要那么贪婪，如何变得容易满足一点？只需要在量词后面加上 ? 即可 1234var reg = /\\d&#123;3,6&#125;?/;var str = &quot;123456789&quot;;str.replace(reg,&apos;替换成这个&apos;);//&quot;替换成这个456789&quot; 可以清楚看到正则只匹配了前面3个数字~这就是正则的非贪婪模式 分支条件如果我只需要匹配100个或者1000个数字呢？就只有100和1000两种可能，而不是100到1000任意一个数字，又该如何对敌？这就要设计到正则的分支条件了 1\\d&#123;100&#125;|\\d&#123;1000&#125; 需要注意的是这个 | 分割的是左右两边所有部分，而不是仅仅连着这个符号的左右两部分，看下图 有时候我们只需要一部分是分支，后面走的是同一条主干，只需要把分支用()包含即可 注意：这个匹配是从正则左边的分支条件开始的，如果左边满足了，那么右边就不会在对比！ 1234var reg = /\\d&#123;4&#125;|\\d&#123;2&#125;/var str = &quot;12345&quot;str.replace(reg,&apos;X&apos;);// &quot;X5&quot; 1234var reg = /\\d&#123;2&#125;|\\d&#123;4&#125;/var str = &quot;12345&quot;str.replace(reg,&apos;X&apos;);//&quot;X345&quot; 前瞻/后顾sometimes，我们要找寻的字符可能还要依靠前后字符来确定比如说我要替换连续的2个数字，而且它的前面要连着是2个英文字母，这样的数字我才要你可能会疑惑,这样写不就完事了吗？ 1\\d&#123;2&#125;\\w&#123;2&#125; 上面匹配的是2个数字和2个字母，虽然是连着的，但是匹配了是4个字符，如果我要替换匹配文本的话，那就替换了4个字符，而我们只想替换2个数字！这个时候就需要用到断言了首先我们需要明白几个点 正则表达式从文本头部到尾部开始解析，文本尾部方向叫做‘前’，也就是往前走，就是往尾巴走 前瞻就是正则表达式匹配到规则（此例中的‘2个数字’）的时候，向前看看，看看是否符合断言（此例中的‘前面连着2个字母’），后瞻/后顾的规则则相反。（javascript不支持后顾） 上表格！ 根据表格内容，我们就可以解决这个问题了，注意\\w包括数字哦~题目要求是连着2个字母 1234var reg = /\\d&#123;2&#125;(?=[a-zA-Z]&#123;2&#125;)/;var str = &quot;1a23bc456def&quot;;str.replace(reg,&apos;X&apos;);//&quot;1aXbc456def&quot; 只替换了数字，没有替换后面的断言哦！ 顺便把这个负向前瞻看看吧 看到这个not followed by 我想你应该知晓用法了 分组当我们要匹配一个出现三次的单词而不是数字的时候，会怎么写呢？你可能会这样写 1hello&#123;3&#125; 然后你打开可视化工具 妈耶，居然只重复了我的o字母！死渣则，好过分 其实，我们只要使用（）就可以达到分组的目的，使量词作用于分组，上面分支条件中的括号亦是如此 分组以后怎么使用分组内容呢？首先看一个问题，如何匹配8个不连续的数字？如果你不使用分组，你会发现根本无从下手，因为你不能判断出有无重复！我们先公布答案，再来分析一波 首先，这个(?!负向前瞻断言A)表达式B，这里使用的是负向前瞻，也就是说断言A前面的内容（表达式B），不能符合表达式A，这个说法很拗口，我嘴巴都拗不过来了。能听明白吧，这个设计就是，我这个断言是“出现重复的数字”，然后表达式是“8个数字”，”8个数字“不能复合“出现重复的数字” 然后，这个 .(\\d). 呢，是先找到一个在任意位置出现的数字，为什么是任意位置呢？因为我们判断的重复可能出现在任何位置；看上面的可视化也就可以明白，\\d前后有0-n个字符,所以说他是任意位置的。 最关键的来了，这个\\1代表什么呢？仔细看你可以发现，\\d加了一个括号，这个括号就代表着分组，那么是几号分组呢？第一个括号就是分组1（默认情况下），如果还有第二个括号，那就是分组2，前瞻的括号是不算的噢，而这个\\1呢就代表着引用这个分组1，使用\\2引用分组2。你也许会好奇，我引用它是相当于在这个位置写了一个\\d吗？NOP，不仅仅这么简单，它引用的是这个\\d的内容，也就是说他会和\\d是一样的值！这不就是重复了吗？！！！这个 .(\\d).\\1 就代表着任意位置出现了任意次数的重复 最后，我们把这些整合在一起就是，匹配8个数字不能出现任意的重复。(?!出现任意重复)8个数字，因为这个(?!)是负向前瞻，所以。。。emmm。。这样就理解了吧。 分组还有其他更详细的内容，但是篇幅有限，马上就到30分钟了。只好捡一些有价值常用的讲了~ 嘿嘿嘿正则就介绍到这里啦~","categories":[],"tags":[]},{"title":"QQ邮箱如何绑定自己的域名，制作自己的独特邮箱！","slug":"QQ邮箱如何绑定自己的域名，制作自己的独特邮箱！","date":"2018-09-07T09:01:46.000Z","updated":"2019-07-02T09:47:44.000Z","comments":true,"path":"2018/09/07/QQ邮箱如何绑定自己的域名，制作自己的独特邮箱！/","link":"","permalink":"https://www.957xx.cc/2018/09/07/QQ邮箱如何绑定自己的域名，制作自己的独特邮箱！/","excerpt":"","text":"​ 今天下午无聊，北京的天气今天清爽了下来，洗个澡坐到了电脑前，一个QQ消息过来。哦~ 我朋友他们公司注册了一个域名，想问我怎么自定义自己的公司的域名，看着更有专业性呢? 碰巧，也今天下午闲下来了。就直接跟他说拉~ 下面看下这个教程说不定对你有帮助哦~ ​ 闲话不多说，我们开始吧！ ​ 首先第一步，先进去QQ邮箱为我们提供专业的域名邮箱入口。(这里注意一点:登陆的账号建议就是你之后管理这个域名的账号) ，进去之后直接点创建域名邮箱 ​ 点我 ​ 第二步: 进去之后，他会根据傻瓜式操作的告诉你，下一步怎么办。现在我们需要做的就是，填写上你的域名(注意必须要有操作的权限，后期需要绑定解析 ) ​ 第三步: 选择你的域名归属，这里直接点其他吧 ​ ​ 第四步: 直接进去验证域名所有权，然后解析到腾讯的服务器上。 这里就需要进去你的云计算的控制面板了，这里腾讯云为例。 当然了，第一个也就是cname的记录了，注意下第二个我们选择 mx记录 随后操作完之后，域名验证好了，现在就可以直接进入账号的控制面板了。 第五步:然后我们就可以管理了，点击管理进入这个页面 好了，设置完了，到这里就好啦。赶紧去叫你的朋友发个邮件帮你看看吧~ 有什么问题不懂的，可以练习我哦","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://www.957xx.cc/tags/技术/"}]},{"title":"半年了，你的梦想又去了哪里?","slug":"半年了，你的梦想又去了哪里","date":"2018-08-10T06:48:09.000Z","updated":"2019-07-02T09:40:34.000Z","comments":true,"path":"2018/08/10/半年了，你的梦想又去了哪里/","link":"","permalink":"https://www.957xx.cc/2018/08/10/半年了，你的梦想又去了哪里/","excerpt":"","text":"不知不觉，半年时间已经过去了。时光如梭，怎么样? 你的梦想呢? 是不是更远了一步? ​ 昨天无意间，无意间看到了以前的小米手机(红 红 红..红米)手机还是以前上高中上面的照片，看到了以前跟同学们的一些合照，想到了上一年同学聚会的场面，谁谁谁都变了许多呀。哎呀，你看看我，想到了这些就又开始怀旧了起来，不知不觉的，时间总是不等人。总是感觉还有时间，可是回头才发现，真的是不珍惜 什么都没有了。 ​ 正当还犯牢骚的时候，忽然想看看春节还有多长时间，似乎出来这么长时间总是感觉时间过的很快。结果一百度，瞬间吓蒙了。自己似乎都不知道过年实在几月，还有多长时间。还得自己百度。 ​ 回忆半年前的那些在一块玩耍，放炮的照片，再看看外面北京这个大城市的蓝天白云，楼下的车辆一辆又一辆的过。光阴似箭，离开村子也半年了。 ​ 然而，我思想还是我刚刚走进社会。还是一个吚吖学语的幼儿，还是一个不谙人世的少年，还是一个刚刚立志的青年。我就应学习东西的才刚刚尝到一滴甘露，应对知识的海洋，我才初涉小溪，刚刚湿脚；应对社会这个大学校，我才刚刚进门，刚刚看到科学的殿堂，才刚刚听到最基础的ABC、AOE；应对人生这道考题，我才刚刚思考，刚刚有了一点初浅的认识，刚刚看到前进的方向，刚刚看到一丝追求目标的亮光…… ​ 但是，这一切容不得你思考，容不得你学习，容不得你偿试，容不得你练习、演习，岁月却已经催人老了，你的人生却已走过少年、青年,转眼间已经走过五分之一了。 ​ 或许人生就是这样，也许人也是这样，总是在不知道珍惜的时候，总以为时间和她(他)都还在，却或过头来，我们都已经分道扬镳了。没办法，眼下只能好好的使劲拼呀,加油 朋友们。 ​","categories":[],"tags":[]},{"title":"那些年我们在北京租过的房子","slug":"那些年我们在北京租过的房子","date":"2018-07-13T12:13:48.000Z","updated":"2019-07-02T09:39:52.000Z","comments":true,"path":"2018/07/13/那些年我们在北京租过的房子/","link":"","permalink":"https://www.957xx.cc/2018/07/13/那些年我们在北京租过的房子/","excerpt":"","text":"2006年，因为转学到北京，我开始在学校门口租房。我人生第一次自己租住的房子，是学校附近不远的城中村。城中村的入口在清华旁边的一条宽广的马路上，门口看只是一条普通的巷子。走进去1000米，才会看到里面别有洞天。这个城中村全部都是平房以及农民自己搭建的小二楼，住着的都是附近卖菜的送水的或者做小生意的一些社会最底层的劳动人民。我住的房间大约有40平米，平房，一月500块，和三个女生一起合住，每人的租金不到200块钱。没有厕所和厨房，都要去公用的厕所，有时候你在坑上蹲着，面前就飘来一只大狼狗。这里什么都有卖，打电话都便宜的很，瓜果梨桃卖的也很便宜。我在这里住了大约一两个月，因此治安不好，天天有房间被盗，而我跟同屋的女生也不太处的来。他们要早起早睡，而我还是学生要做功课。几次矛盾下来，我就离开了。我再也没有回去过，但是每次看到电视里南方工厂里打工妹生活的纪录片，我就会想起那个地方来，总觉得，那是特别珍贵的一段经历和记忆。 后来我搬家到学校门口一个房子里的床位，一个三居室，住着14个人，我的小房间有四个女生，另外一个大房间有八个男生，还有一对小情侣在小屋里住着，每人300元每月。我在这里住了大约两年，舍友换了无数无数，中国的外国的，打工的考研的，精神正常的精神不正常的。有个姐姐的老公在对面的学校里读博士，她在门口租一个床位陪读，后来他们毕业后一起去了美国。有个女生在那个屋子里考了三年北大光华MBA，终于梦想成真，考上的那一年她哭的坐不起来。有人在那个屋子里恋爱又失恋，有人在那个屋子里每天摔摔打打。每天晚上排队洗澡洗衣服像一个风景，着急的时候头冲着水龙头随便洗一下就湿漉漉的去上课了。那时候似乎谁都没有想起来还有吹风机，也不觉得人多。14个人一起在客厅看电视的时候，拥挤的场面简直像世界杯直播一样热闹。 大学最后一学期，我因为实习在CBD区，天天上班要2个小时实在要吐血了，于是在北京大望路地铁站旁边与人合租了一间房。这间房子总共6平米，一人一张床占4平米，还有半平米放衣柜，1.5平米的地面。这间房子价格800元，我和另一个女生一人400元，那时候实习工资是每月1200，后来变成1760。我们两个都是一个行业，因此相处还比较容易。我实习时候经常加班到深夜，每次回来的时候，她已经睡了，只有灯亮着电脑开着收音机在被子里也开着。每次回家都要翻开她被子找收音机关掉，再关灯关电脑。她的电脑是台式机，总是轰轰的声音，我叫她的电脑是拖拉机。我们一起住了半年，彼此毕业开始正式工作，但低廉的工资让我们依旧只能还住在这个楼里，因为这里是还算黄金位置的大望路地铁边上唯一的年代久远的筒子楼，价格比同小区的高层住宅要便宜很多。 她换到另外一个20平米的大房间里与人合租，我继续一人租这个小房间租了半年。这期间，我很好的大学朋友去了法国读MBA，临走和我坐在小房子里聊天，房子太小了，我有点不好意思让她来。我妈来北京看奥运会也住在这里，因为太热没有空调，我妈睡在地上，我睡在床上。我妈后来说，看见我住的这么小，心里很难受。这期间我还买了我第一个笔记本，是一个二手的笔记本，1200元钱，我就是用这个笔记本开始了我的写作道路，一直到三年后这个本光荣就义。 再过半年，隔壁的姑娘要换房子，我就去了隔壁20平米的大房间，每月1000元，水电网另计，怎么也要每月1200吧。网络我从一楼的一户人家牵线上来，上来后还分给三家用，因此每月大约20块钱就够了。到现在每次交很贵的网费的时候总是想起这事儿，还总想总隔壁分一根线，可惜没人跟我分了。要说这个房子大而光明，还挺不错的，但唯一的问题是厕所。因为四家合用，隔壁是三个男生，一对夫妻，门口那家是八个洗脚妹，人多到厕所巨堵，到后期天天屎飘在马桶里，你还不得不继续上。更惨烈的是有时候你在旁边洗澡，旁边就是飘着屎的马桶。找人来通了很多很多次，但终究不知道为什么还总是要赌。门口的打工妹用洗衣机总是把水流到楼道里，楼上和楼下的邻居就会来破口大骂，好几次打110报警，每次我都要连哄带骗的安慰邻居，再收拾楼道，因为洗脚妹们开着洗衣机就不知道去哪儿玩儿去了。在这个房子里，我开始每天1500字写博客，雷打不动的坚持，就是从这个房子里开始的。开始用电饭锅给自己做饭，买了一个二手洗衣机200块钱，都是从这里开始。 房子到期后，我决定离开这个屎太多的地方。于是在网上找到了蒲黄榆的一个房子。这是个大约有20年历史的老房子，是个高层，还是个银行的宿舍，因此邻居都是老人家，且鲜有租客。房子陈旧，但能看得出当年是新房的时候，房东还是花了大力气装成当年最时髦的样子，家具虽然过时，都都是上好的实打实的实木家具。在这里，我结交了非常好的朋友。他们知道我是个半夜写作白天上班的人，因此主动承担起三年倒垃圾打扫卫生的工作，从来不用我动手，也不用操心。可能我做饭比较烂，他们每次都做好饭给我送来吃，从来不让我进厨房，还说我进厨房一次她们要收拾半宿还是她们来吧。起初我在这里租住最小的房间6平米，600元，小小的热热的但很温馨，我就在这个小房间里写了我人生的第一本书《从北京到台湾这么近那么远》。那时候记者来我家采访，三个人根本站不进来，只能我和记者坐在床上，摄影大哥站门口，还一位站走廊里。现在每次看到这本书，都忍不住想到那些小日子，只有梦想，能让人克服一切的困难，让每天的日子，都闪闪发亮！ 后来我转到隔壁20平米1000元每月的房间里，到我走的时候房间的价格差不多1500一个月，因为是房东直租，依旧算是很便宜的价格吧。只是唯一重大的问题是，这个房间楼下正对着一个神经衰弱还有心脏病的老太太，只要我在楼上小心翼翼的走一步路，老太太都会认为是之天大的声音而找上门来，甚至为此心脏病发急救过。后来，房东把新买的地毯都放在了我的房间里，老太太依然能听到声音，甚至半夜一点把110叫来投诉我扰民，可是110来了看见什么都没有随便打发下就走了。无力承受老太太的生命，只能三五天去一趟老太太家，提着瓜果梨桃去看看她是在家好好的还是又去医院了。在这个房间里， 我写了我人生第三本书，并跳了槽，度过了两年半的时光，我毕业后重要的人生转变，职场转变，以及迅速的成熟长大都是在这里，包括遇到至好的朋友，以及终于过上了安全而安稳的生活。 后来，因为租房的价格愈发昂贵，我买了房子；再后来我结婚，又换到了婚房里。尽管自己的房子干净又整洁，安静又安稳，但我总记得那些租房子的时光，那些铭刻在我青春里的每一天，那些心惊胆战又脏乱差的日子，或者被110训话或被邻居投诉的日子，像利剑挂在我心上，又像星星，回想起来会给自己点赞。直到现在，我依旧喜欢帮朋友找房子，喜欢没事儿看租房网站，总会回想起以前自己租房的日子，以及那些在下班后黑灯瞎火与中介去黑漆漆的小区看房子的场景。 我一直相信，有一天每一个人都会有自己的房子，自己的家庭。这大千世界的一隅，总有一天会有一盏等着我们回家的灯。而年轻的时候所有的颠沛流离都将成为日后心中的慰藉，是青春的圣火，是跃动的生命。它们闪着光，透着亮，提醒着我们曾经那么年轻，曾经那么敢闯，曾经天不怕地不怕，曾经什么都可以接受和忍耐。 所有的年轻，有一天都会长大与成熟，当回忆往事的时候，望着远方，怦然一笑，就是对青春时光里所有的所有，最好的诠释与珍藏。","categories":[],"tags":[{"name":"鸡汤","slug":"鸡汤","permalink":"https://www.957xx.cc/tags/鸡汤/"}]},{"title":"我的一个道姑朋友-背景","slug":"我的一个道姑朋友-背景","date":"2018-07-03T12:31:03.000Z","updated":"2018-07-12T02:14:24.000Z","comments":true,"path":"2018/07/03/我的一个道姑朋友-背景/","link":"","permalink":"https://www.957xx.cc/2018/07/03/我的一个道姑朋友-背景/","excerpt":"","text":"陌生人，你好。欢迎来到这里！ 也许你也听过我的一个道姑朋友，感受也许很深，也许很浅。当然这并不重要，让我们一起来了解这首歌的背景，我相信，你看完后会有些感受。 由于我找很长时间没找到以冬的链接，只能搜索播放器的链接奉上想听的朋友可以点击下：点我 女主：​ 我是个孤儿，那天我上山采药,突然下暴雨。不 知所措的我躲在屋檐下等雨停恍然看见一个 与我年龄相仿的少年。 他身着白衣撑着伞朝我走来，说要送我回家，而 我早已陷入他那对深邃的眼眸中心内一阵 悸动。他一把拉我入伞下。 我得知他是山上的道士，也刚好下山采药，他把 伞赠予我，一个人回去了。 还在茅屋门口目送他的我愣在原地。后来我采 药卖钱买了一盒桂花糕去山上和他道谢，他也很开心的样子收下了。我和他走在山路上像是孩子一样嬉戏，他送我 下山。之后我便总去给他送东西，不论是自己 做的还是买的，他也都会很开心的收下 ，之后我们聊着天。 ​ 每次他都送我下山，我们一 起骑着马一起游玩。 记得我送给他马具的时候他特别开心，他扶着在 我耳边说一直会保护我。 这天突然下暴雨，我住的茅屋破烂,于是决定去 山上当一个道姑，这样就能永远陪着他了。 ​ 我带着他送给我的伞，还有为数不多的家产上 山去当了道姑，但他好像不在。另一个道长再三问我是不是确定好了要当道姑 ，当了道姑后要断红尘，即使这能永远陪在他身 边也好。 于是就换了一身素装，成了一名道姑，之后的日 子每天都能与他遇见，他还是原来的样子总是 和我嬉闹。 但我总是发现他老是下山而且越来越频繁，但 每次回来都会给我带来胭脂红妆什么的送给 我，我开心极了。 ​ 这天夜晚，他刚从山下回来，敲我房门，要送给我一个胭脂,说这是最新款的，女孩子用了后特别漂亮，我开心极了。对他说，这样好像不太好,总是送我东西，被其他人看见就不好了，他说只管收着就好了。他问我，思念一个人是什么感觉，还没等我回答，他就转身离去了，我心里一阵悸动。就这样过了三年。 ​ 这天他突然说要还俗，因为他和乡下一个卖胭脂的姑娘私定了终身，并且答应要娶她,于是道长带着大家的祝福收拾收拾就下山了，我呆呆的愣在原地，眼眶渐渐湿润。原来三年前他喜欢的就不是我，那送我的那些胭脂只是为了讨好她，思念的人自然也不是我，想到这我泪水再也忍不住。不久就传来道长喜宴的消息，我假装偶然赶上他们的喜宴，他看见是我先是 愣了一下。 ​ 他还是一身白衣如旧，依附在他身旁的佳人有如花的颜容。 她问他我是谁，他说是以前在山上当道士的 时候的 一个道姑朋友，身边佳人有露出了甜美的笑 容。此时不知为什么决定他们很是般配。但是 我还是想上前问他，是不是我送的马具不够好 看，是不是那天的桂花糕我没捂热， 是不是世上的人都是这样连自己的承诺都可 以随 意的收回。 好想一把上前抱住他在他白皙的侧脸留一个唇印，任旁人惊讶，可是我不能，只能强忍微笑给了 他们祝福,并把当年道长送我的伞送给了他们当作贺礼。 我在角落里独自饮酒，转身离去谁也没看见 我转身后的泪如雨下。 ​ 后来我一个人去了很多地方 从春天一直走到冬天，那个时候的那件事和事 里的那个人，就好像我做的一场梦。 现在梦醒了，什么都没了。 道士：我是一个道士，却爱上了一个经常上山探药的 姑娘，她不知道我怕她发生危险经常在远处保护着她。 那天突下暴雨，见她却无带伞连忙寻伞去接她， 我一身白衣见她檐下避雨，一把拉入伞下， 我说送她回家。 姑娘面色绯红眼里闪着光，那是我这辈子见 到的最动人的眼神。我把伞赠予了她,独自一人回了山上。 后来她 到观中送来一盒桂花糕 与我道谢，以表感激我 送她下山，我和她走在山路上，她一直专心倾听 着我说的话。之后她总是会到观里来送我不同的东西，每次我都会收下后，和她一起聊天，送她下山。我们 一起骑马游玩,记得有一次她送我一具马鞍,我 那天很开心，把她拥入怀下伏在她耳边许道 ,我会一直保护她。 原本心中定了还俗的念想， 这天天下暴雨，我一个道友告知我，有位姑娘在 观中当了道姑，她一身素衣看见我后好像很开 心的样子，但我却心中忧郁万千，后来才知道她 是为了我才当了道姑。 还是，原来那样我们每天都有很多话聊为了讨 她欢心，我每次都会从山下挑一盒胭脂红妆回来送她，她也都会很开心的收下。 ​ 这天晚上我挑了一个非常贵重的胭脂给她送了 过去她怕被人看见了不好，我说只管收着就好，问她，你知道思念是什么感觉么?她深思，我却 没等她回我便离开了去。 就这样过去了三年，一天我在山下胭脂摊挑选 胭脂，卖胭脂的是一位姑娘身着艳丽,却也没 过多注意。 不料下起暴雨，傍无伞具。姑娘见状便留我小 坐略饮薄茶等雨后天晴再走不迟。 ​ 半饮过后，头感昏沉，心中情起。翌日早上，姑娘 |给我看榻上落红，并要我负责，虽尽是愧疚与悲 戚，但也不能推辞责任，免姑娘日后难见他人，那 天晚上我一人楼中独饮,心中她的身影若影若 现，不敢再去与她相见。 后来我还俗与姑娘大喜当天，她身红衣红唇， 美得凄凉，我却不敢正眼看她 身旁佳人问到她是谁，我只轻声回她一句那是我的一个道姑朋友。 ​ 这天她一个人在角落不停地喝酒,最后也不知道她是怎么离开的。 傍晚,在满布红烛的房间里，佳人一人独坐红 榻。我抚摸着她送我的那具马鞍， 从袖中拿出那温热的桂花糕送入嘴中，眼中湿 润已久心里想的却不是眼前人。 胭脂姑娘：​ 我是个卖胭脂的姑娘，他是山上的道士我偷偷 留意他很久了。 在一个暴雨天我在我的摊位旁看到了他，为另 一个模样清秀的姑娘撑伞， 他们轻轻相拥，他说着好听的诺言说想一直拥 着她，那姑娘面色绯红，眼里闪着光一那是我这 辈子见到的最动人的眼神，但是我却嫉妒得发 狂,我一定要阻止他们在一起! !不久后，听说那姑娘当了道姑，我有些不理解她 的想法。 ​ 但是,就在她当道姑那一天，我看到了 山下的他，我化着精致的妆容， 一颦一笑皆是风情，莲步轻移眉眼低垂，这是我有意为之的，我对自己的容颜有着十足的自信， 他却熟视无睹， 只是细细询问我各种胭脂的用法，后来他买了 几盒胭脂，脸_上漾着笑，他是在想她吧 不行，他是我爱的男人，我要用我的万种风情得 到他!他走后，我在铜镜前仔细端详自己的容颜，不知为何，却觉得 此刻的我的一双桃花眼竟比不上那个小 道姑的一对眸子..后来他常来我的店铺挑选胭 脂，但也只是选胭脂而已。 终于，有一天，他挑完胭脂后下起了雨，他没带伞， 我留他小坐略饮薄酒，并在他的酒中加了 催情，药，他浑然不觉… ​ 那个夜晚，我的阁中春色浓。翌日早上，我给他看榻上的落红，并要他负责，他的眼中尽是愧疚与悲戚，良久，他同意了。 大婚那日锣鼓喧天，好不热闹，我却看到了红唇 红衣的她，她明明只是中上之姿，比起我可差远 了,此刻我却觉得她有一种惊心动魄的美，我故 意在她面前问他这是谁，他怔了一刻随即平静 1地说道:”她是我的一个道姑朋友。” ​ 我乖巧地点了点头，拉他到一旁后来我看到她在角落里不停地饮酒 ，她是怎么离开的我也不得而知。傍晚,在布满 红烛的房间里，他并没有碰我，让我先睡我却在 深夜看到他抚摸着一副马 鞍,往嘴里塞着桂花 糕，压抑着自己的哭声。 房间的角落静静地躺着一把油纸伞. 婚礼上的一名宾客：​ 我是婚礼上的一位宾客，至于叫什么就不便透 露了。卖胭脂的姑娘结婚了邀请我们这些邻 里去参加婚礼。 那个姑娘啊，我看着她从蹒跚学步到如今的豆 蔻年华，不知不觉居然要嫁人了。 外 面锣鼓喧天，屋里张灯结彩，好派喜庆的模 样。 可新郎生硬 的抱着新娘一脸落 寞看不 出一 丝的欢喜。 ​ 直到一位红衣道姑的出现才让他眼中焕发出惊 人的神采，我才觉得事情好像不是那么简单。 胭脂姑娘 问他那女子是谁，他愣了一下故作平 淡的说:“她是我的一个道姑朋友”。 多么平淡的一句话，可是我从里面听出了多么 复杂的情感一 不甘、愧疚、心灰意冷 于是我便留意起那位道姑朋友她看着淡然的 新郎红了眼眶，只是不停的饮酒.. 心里突然堵得慌。 ​ 我原来并不是一个多愁善感的人。是道长那一 瞬间仿佛活了过来的神采 ，还是道姑踉踉跄跄离去时眼角挂着的泪珠触 动了我?我不得而知，我只是觉得他们才是本应 该在起的人… 犹记那日天降大雨，我坐在门前屋檐下看见一 位道长撑伞雨中前行，白衣淡然,翩若惊鸿。 他把一位姑娘拥入怀中脸上溢着淡淡的笑容， 或许才这是抱住了幸福的模样吧.. 结局： 道士走后，留下胭脂姑娘，没人知道道姑走到哪里，道士只想一直找 下去他相信总有一天会找到她…道姑走过海边，这是她第一次见到海，可她想与心中的那人一起倾听大海的声音想到这,她自嘲的笑笑，几天后路过这里，一位白衣少年驾着马,他心想:她一定会喜欢大海。 ​ 可少年没有停下，他不敢停下，害怕再次错过 她。道姑来到瀑布下，站在一块石头 上感受 到冰凉的水珠轻吻着她的脸颊她不禁想起那年道士大婚时她很想走_上去 把抱住他,在他白 净的脸留一 个唇印。怎么又想起这件事，道姑自言自语道。 几天后，白衣少年依旧马不停蹄地赶着。 连风景都来不及看。 ​ 五年过去了，少年陪道姑看完了这世间的繁华 和苍凉。 他们近在咫尺却远在天变道姑来到了洛阳，正 值夏季，突然来的暴雨让道姑不知所措，慌乱中 她跌入了一个温暖的怀抱，她吓得-愣， 抬眼一看，一张陌生的脸她有些失望眼底闪 过一抹不经意间的落寞， 1但她很快反应过来的对那个人道歉. 她想着:他应该已经和那位姑娘都有了孩子吧， 怎会来寻我。 水从她脸_上划过，不知是泪水还是雨水。 这时，一双好看的手将她拉入怀中道士在她耳 边轻声说到“我找了你五年,还俗吧，我娶你。 感谢总结： 首先给看完的棒棒的你一个掌声，由于文章的字数较多。可能分段本人分的也不太好，也感谢你，陌生人！能看完这篇文章。 也许我们的人生就是一段旅行，一声会看见很多人可是真正有感觉的人总是那么一两个。走到一起真的不容易，珍惜眼前情义。","categories":[],"tags":[{"name":"谈心","slug":"谈心","permalink":"https://www.957xx.cc/tags/谈心/"}]},{"title":"老朋友，别来无恙啊。","slug":"欢迎来到小轲博客","date":"2018-06-28T12:33:39.000Z","updated":"2018-07-12T02:11:52.000Z","comments":true,"path":"2018/06/28/欢迎来到小轲博客/","link":"","permalink":"https://www.957xx.cc/2018/06/28/欢迎来到小轲博客/","excerpt":"","text":"hi，Friend ，hello hexo朋友，你好啊~ 别来无恙啊。 没错，你又看到了，我好像又折腾了一波。 估计这次完事之后不会在折腾了，等着穷到毕业~ 但是这个博客也是挺好的，做的其中遇到了很多的问题，也特别感谢我的表哥@唯美陌阡,因为从来没想过这么多问题。也是做起来比动态博客还要麻烦的一批~帮助我解决了很多问题。 反正最后磕磕绊绊的还是过来了~ 为何要搬过来？做一个动态博客的成本确实不小，在我这个小小的学生狗面前还是付不起那种高级的服务器费用，同时这个没有那么多限制，可以随心所欲。恩 还得继续 加油！","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://www.957xx.cc/tags/技术/"}]},{"title":"video玩出新花样当background","slug":"video","date":"2018-05-20T00:47:52.000Z","updated":"2018-07-12T02:11:50.000Z","comments":true,"path":"2018/05/20/video/","link":"","permalink":"https://www.957xx.cc/2018/05/20/video/","excerpt":"","text":"hi,好久不见啊。转眼间端午节了，不知道你们又在干嘛呢？别的不扯了，端午节快乐啊哈~因为前几天我们要进行网页设计大赛，所以我们小组又焦头烂额的坐在了一起：“又做东西啊，烦死了”！最终我们还是做出来了。也得了个第一名，虽然不怎么好。但也是对自己努力的一个肯定。学习中遇见了一些问题就不说了，我们做的页面是支付宝全站，但是支付宝个人中心有一个拿video当做视频背景的元素，我们一直没搞懂。但是恍然大悟，我们可以使用z-index属性来定义啊。好那么我们详细欣赏下面的教程！下面先给大家截图一下这个效果吧，大神勿喷~ 但是截图的又不能动~~剁了话不多说我们先来分析一波，首先我们这个东西用视频当做背景，所以背景一定在下面的，所以设置他的层级代码肯定为负的最多的，因为上面要放内容。那么我们既然弄肯定要全屏还有把他固定在哪里，即使我们不设置数值。然后设置他的显示亮度。多了不说了css代码上了。 那么看到这里就有疑问了，有人问 -webkit-filter:grayscale(100%) 这段代码是干嘛的，显示的亮度。但是需要支付浏览器，webkit是兼容谷歌的，如果展示在用户面前需要兼容多个浏览器，具体的自行百度下。 好那么我们css设置完成了，好我们展示下我们html的代码吧。这个代码其实就是正常的插入一段视频。无需多的理解。 好一个视频已经展现在我们的面前，总是感觉视频的速度可能播放太快或者太慢没有视觉感觉。好我们定义一下他的视频背景，首先这个 id=v1 v1是自己取得名字，这个根据开发者自己来定。其中的0.5自行改数值。 就这么简单我们的一个页面已经制作完成啦。现在我们看下效果吧！有什么不懂得可以QQ问我哦~","categories":[],"tags":[{"name":"技术","slug":"技术","permalink":"https://www.957xx.cc/tags/技术/"}]}]}